// //Напишите программу, кот. на вход принимает трехзначное число и на выходе показывает последнюю цифру этого числа.
//456 -> 6



int num = Convert.ToInt32(Console.ReadLine ());

Console.WriteLine(num % 10);

